In [1]:
import pandas as pd

To List all the datasets, which we have

In [2]:
import os
os.listdir('../../datasets')

['.DS_Store',
 '.ipynb_checkpoints',
 '107983_aariclist_25k.csv',
 'customer.csv',
 'customers.csv',
 'example.csv',
 'fifa19.csv',
 'fifa19.zip',
 'file_example_CSV_5000.csv',
 'formula-1-race-data-19502017',
 'Fremont_Bridge_Hourly_Bicycle_Counts_by_Month_October_2012_to_present.csv',
 'google-play-store-apps',
 'IMDB_Movie.csv',
 'IMDB_Movie.html',
 'IMDB_Movie.json',
 'IMDB_Movie.xlsx',
 'IMDB_Movie_2columns.csv',
 'IMDB_Movie_3columns.csv',
 'IMDB_Movie_3columns.html',
 'IMDB_Movie_3columns.json',
 'IMDB_Movie_3columns.xls',
 'IMDB_Movie_3columns_without_index.csv',
 'IMDB_Movie_3columns_with_index.csv',
 'IMDB_Movie_Apply.csv',
 'imdb_movie_cleanup.csv',
 'IMDB_Movie_Facebook_Like.csv',
 'IMDB_Movie_Filter.csv',
 'IMDB_Movie_Overview.csv',
 'IMDB_Movie_Sorting.csv',
 'international-airline-passengers.csv',
 'Land Usage Report.csv',
 'lynda.com Courses.csv',
 'MplsStops.csv',
 'multiTimeline.csv',
 'Nightingale.xlsx',
 'opsd_germany_daily.csv',
 'orders.csv',
 'output-1.csv',
 'pandas_created_file.csv',
 'pivot-tables.xlsx',
 'PJME_hourly.csv',
 'Sales_Data.json',
 'Sales_Data.xlsx',
 'ted_main.csv',
 'Titanic_Desaster.csv',
 'Weather_2012.csv',
 'weight-height.zip',
 'world-happiness-report-2019.csv']

### 1. loading data from csv

In [3]:
df_csv = pd.read_csv('../../datasets/IMDB_Movie_3columns.csv')
df_csv.head()

,movie_title,director_name,title_year
0,Avatar,James Cameron,2009.0
1,Pirates of the Caribbean: At World's End,Gore Verbinski,2007.0
2,Spectre,Sam Mendes,2015.0
3,The Dark Knight Rises,Christopher Nolan,2012.0
4,Star Wars: Episode VII - The Force Awakens ...,Doug Walker,NaN

In [4]:
df_csv2 = pd.read_csv('https://vincentarelbundock.github.io/Rdatasets/csv/boot/amis.csv')
df_csv2.head()

   Unnamed: 0  speed  period  warning  pair
0           1     26       1        1     1
1           2     26       1        1     1
2           3     26       1        1     1
3           4     26       1        1     1
4           5     27       1        1     1

### 2. loading data from excel
    - user could choose sheet number incase excel file contain multiple sheet

In [5]:
df_excel = pd.read_excel('../../datasets/IMDB_Movie.xlsx', sheet_name=0)
df_excel

                                 movie_title   director_name  title_year
0                                    Avatar    James Cameron        2009
1  Pirates of the Caribbean: At World's End   Gore Verbinski        2007
2                                   Spectre       Sam Mendes        2015

### 3. loading data from json

In [6]:
df_json = pd.read_json('../../datasets/IMDB_Movie.json')
df_json.head()

                                movie_title   director_name  title_year
0                                    Avatar   James Cameron        2009
1  Pirates of the Caribbean: At World's End  Gore Verbinski        2007
2                                   Spectre      Sam Mendes        2015

### 4. loading data from a table on html web page
    - note that read_html return a list of data table, so to access one talbe need to have table index

In [7]:
df_html = pd.read_html('../../datasets/IMDB_Movie.html')
df_html[0].head()

,Unnamed: 0,movie_title,director_name,title_year
0,0,Avatar,James Cameron,2009.0
1,1,Pirates of the Caribbean: At World's End,Gore Verbinski,2007.0
2,2,Spectre,Sam Mendes,2015.0

In [8]:
df_html

[   Unnamed: 0                               movie_title   director_name  \
 0           0                                    Avatar   James Cameron
 1           1  Pirates of the Caribbean: At World's End  Gore Verbinski
 2           2                                   Spectre      Sam Mendes

    title_year
 0      2009.0
 1      2007.0
 2      2015.0  ]

### 5. loading from a python dictionary
    - key become columns name
    - value become row data

In [9]:
studentData = {
    'name' : ['jack', 'Riti', 'Aadi'],
    'age' : [34, 30, 16],
    'city' : ['Sydney', 'Delhi', 'New york']
}

df_dic = pd.DataFrame(studentData)
df_dic

   name  age      city
0  jack   34    Sydney
1  Riti   30     Delhi
2  Aadi   16  New york

### 6. loading from a python class instance

In [10]:
class Company:
    def __init__(self, name, addr, comp_val):
        self.name = name
        self.addr = addr
        self.__comp_val = comp_val
    
    def to_dict(self):
        return {
            'name': self.name,
            'addr': self.addr,
            'comp_val': self.__comp_val
        }

# instantiation 
c1 = Company('apple', 'addr1', 1111)
c2 = Company('microsoft', 'addr2', 2222)
c3 = Company('tesla', 'addr3', 3333)

df = pd.DataFrame([inst.to_dict() for inst in [c1,c2, c3]])
print(df)

        name   addr  comp_val
0      apple  addr1      1111
1  microsoft  addr2      2222
2      tesla  addr3      3333

### 7. loading data from coinmarketcap

In [11]:
df_cmc = pd.read_html('http://coinmarketcap.com')
df_cmc

[    Unnamed: 0    #             Name       Price  24h %    7d %  \
 0          NaN  1.0   Bitcoin1BTCBuy  $42,780.61  2.64%   7.58%
 1          NaN  2.0  Ethereum2ETHBuy   $3,237.67  5.27%  15.22%
 2          NaN  3.0   Tether3USDTBuy       $1.00  0.02%   0.01%
 3          NaN  4.0       BNB4BNBBuy     $461.09  8.70%   9.85%
 4          NaN  5.0    Solana5SOLBuy     $141.97  4.83%  15.93%
 ..         ...  ...              ...         ...    ...     ...
 95         NaN  NaN        BancorBNT       $3.19    NaN     NaN
 96         NaN  NaN         BORABORA       $0.94    NaN     NaN
 97         NaN  NaN          WAXWAXP       $0.41    NaN     NaN
 98         NaN  NaN        DecredDCR      $56.59    NaN     NaN
 99         NaN  NaN     renBTCRENBTC   $42847.01    NaN     NaN

                   Market Cap                         Volume(24h)  \
 0   $809.68B$809,677,631,376          $26,754,358,618625,385 BTC
 1   $385.67B$385,670,988,353        $15,485,485,2954,782,903 ETH
 2     $78.31B$78,306,295,306  $59,459,935,81659,439,333,929 USDT
 3     $76.91B$76,910,025,485         $4,557,784,4009,884,845 BNB
 4     $44.24B$44,242,928,966        $1,572,603,94511,077,268 SOL
 ..                       ...                                 ...
 95                       NaN                                 NaN
 96                       NaN                                 NaN
 97                       NaN                                 NaN
 98                       NaN                                 NaN
 99                       NaN                                 NaN

      Circulating Supply  Last 7 Days  Unnamed: 10
 0        18,926,275 BTC          NaN          NaN
 1       119,119,746 ETH          NaN          NaN
 2   78,279,163,467 USDT          NaN          NaN
 3       166,801,148 BNB          NaN          NaN
 4       311,642,840 SOL          NaN          NaN
 ..                  ...          ...          ...
 95                  NaN          NaN          NaN
 96                  NaN          NaN          NaN
 97                  NaN          NaN          NaN
 98                  NaN          NaN          NaN
 99                  NaN          NaN          NaN

 [100 rows x 11 columns]]

In [12]:
len(df_cmc)

1

In [13]:
df_cmc[0]

,Unnamed: 0,#,Name,Price,24h %,7d %,Market Cap,Volume(24h),Circulating Supply,Last 7 Days,Unnamed: 10
0,NaN,1.0,Bitcoin1BTCBuy,"$42,780.61",2.64%,7.58%,"$809.68B$809,677,631,376","$26,754,358,618625,385 BTC","18,926,275 BTC",NaN,NaN
1,NaN,2.0,Ethereum2ETHBuy,"$3,237.67",5.27%,15.22%,"$385.67B$385,670,988,353","$15,485,485,2954,782,903 ETH","119,119,746 ETH",NaN,NaN
2,NaN,3.0,Tether3USDTBuy,$1.00,0.02%,0.01%,"$78.31B$78,306,295,306","$59,459,935,81659,439,333,929 USDT","78,279,163,467 USDT",NaN,NaN
3,NaN,4.0,BNB4BNBBuy,$461.09,8.70%,9.85%,"$76.91B$76,910,025,485","$4,557,784,4009,884,845 BNB","166,801,148 BNB",NaN,NaN
4,NaN,5.0,Solana5SOLBuy,$141.97,4.83%,15.93%,"$44.24B$44,242,928,966","$1,572,603,94511,077,268 SOL","311,642,840 SOL",NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...
95,NaN,NaN,BancorBNT,$3.19,NaN,NaN,NaN,NaN,NaN,NaN,NaN
96,NaN,NaN,BORABORA,$0.94,NaN,NaN,NaN,NaN,NaN,NaN,NaN
97,NaN,NaN,WAXWAXP,$0.41,NaN,NaN,NaN,NaN,NaN,NaN,NaN
98,NaN,NaN,DecredDCR,$56.59,NaN,NaN,NaN,NaN,NaN,NaN,NaN
99,NaN,NaN,renBTCRENBTC,$42847.01,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [14]:
df_cmc_table = df_cmc[0][['Name', 'Market Cap', 'Price', 'Volume(24h)', 'Circulating Supply']]
df_cmc_table.head(3)

,Name,Market Cap,Price,Volume(24h),Circulating Supply
0,Bitcoin1BTCBuy,"$809.68B$809,677,631,376","$42,780.61","$26,754,358,618625,385 BTC","18,926,275 BTC"
1,Ethereum2ETHBuy,"$385.67B$385,670,988,353","$3,237.67","$15,485,485,2954,782,903 ETH","119,119,746 ETH"
2,Tether3USDTBuy,"$78.31B$78,306,295,306",$1.00,"$59,459,935,81659,439,333,929 USDT","78,279,163,467 USDT"

### 8. Reading from tabular data file - csv, excel, tsv, .. table-like data format

read_table assumptions:
- file is separated by tabs
- presence of a header role

In [15]:
# reading a well-formatted .tsv file
url = 'http://bit.ly/chiporders'
orders = pd.read_table(url)

orders.head()

,order_id,quantity,item_name,choice_description,item_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,$2.39
1,1,1,Izze,[Clementine],$3.39
2,1,1,Nantucket Nectar,[Apple],$3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,$2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98

In [16]:
url2 = 'http://bit.ly/movieusers'
users = pd.read_table(url2)

users.head()

   1|24|M|technician|85711
0       2|53|F|other|94043
1      3|23|M|writer|32067
2  4|24|M|technician|43537
3       5|33|F|other|15213
4   6|42|M|executive|98101

In [17]:
user_cols = ['user_id', 'age', 'gender', 'occupation', 'zip_code']
users = pd.read_table(url2, sep='|', header=None, names=user_cols)

users.head()

   user_id  age gender  occupation zip_code
0        1   24      M  technician    85711
1        2   53      F       other    94043
2        3   23      M      writer    32067
3        4   24      M  technician    43537
4        5   33      F       other    15213

__NOTE:__

        when loading large dataset with python dataframe, the best practices are 
        a. To load in chucks
        b. filter out unwanted columns 
        c. optimizing the memory usage with using astype() for the columns